## Trager Guided Ordinal Encoding

It is a techinque used to encoded categorical variable based on their relationship with target variable.This encoding techinque is useful when we have a categorical variable with a large number of unique categories,and we want to use this variable as a feature in our machine leraning model.

In Target Guided Ordinal Encoding,we replace each categorical variable with a numerical value based on the mean or meadian of the target varianble of that category.This creates a monotoric relationship between the categorical variable and the target variable,which can improve the predective power of our model.

In [1]:
import pandas as pd
df=pd.DataFrame({
    'city':['New York','London','Pairs','Tokyo','New York','Paris'],
    'price':[200,150,300,250,180,320]
})

In [2]:
df

       city  price
0  New York    200
1    London    150
2     Pairs    300
3     Tokyo    250
4  New York    180
5     Paris    320

In [4]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [5]:
mean_price

{'London': 150.0,
 'New York': 190.0,
 'Pairs': 300.0,
 'Paris': 320.0,
 'Tokyo': 250.0}

In [6]:
df['city_encoded']=df['city'].map(mean_price)

In [7]:
df

       city  price  city_encoded
0  New York    200         190.0
1    London    150         150.0
2     Pairs    300         300.0
3     Tokyo    250         250.0
4  New York    180         190.0
5     Paris    320         320.0

In [8]:
df[['price','city_encoded']]

   price  city_encoded
0    200         190.0
1    150         150.0
2    300         300.0
3    250         250.0
4    180         190.0
5    320         320.0